<template>
  <div id="app">
    <Header/>
    <SideBar />
    <div class="container">
      <div class="container__cover">
        <div class="container__logo">
          <img src="./assets/scarlet_white.svg" alt>
          <img src="./assets/logo_white.svg" alt="">
        </div>
      </div>
      <div class="container__content">
        <div class="container__header">
          <div class="container__share">
            <div class="side-bar__share__link"><a href=""><img src="./assets/facebook.svg" alt=""></a></div>
            <div class="side-bar__share__link"><a href=""><img src="./assets/vk.svg" alt=""></a></div>
            <div class="side-bar__share__link"><a href=""><img src="./assets/twitter.svg" alt=""></a></div>
          </div>
          <h1>Как найти свою любовь</h1>
          <p>
            Любовь может случиться с вами в любое время. Мы разобрались, как это происходит: где больше шансов удачно
            познакомиться и как вести себя на первом свидании.
          </p>
          <p class="container__header-right">
            Если вы уже нашли любовь, расскажите, как вам это удалось. Авторы четырёх лучших историй получат в подарок
            бытовую технику от SCARLETT: сохранить любовь проще, когда домашние дела занимают меньше времени.
          </p>
          <p class="container__header-right">
            Для участия в конкурсе авторизуйтесь с помощью профиля «ВКонтакте». С одного аккаунта можно отправить одну
            историю.
          </p>
        </div>
        <Form />
        <div class="container__inner">
          <div id="item1" class="container__item">
            <p>
              Ваши советы мы собираем на специальной странице (ссылка на лендинг). Х апреля жюри SCARLETT выберет из
              них
              лучшие и подарит авторам призы.
            </p>
            <ArticleCover number="01" :img="item1">
              <span>
                Бывает ли любовь
              </span>
              <span>
                С первого взгляда
              </span>
            </ArticleCover>
            <p>
              У учёных нет точного ответа на этот вопрос, но есть любопытные исследования. Например, в Голландии
              <span v-on:click="open" class="link">провели
                <span class="tooltip">
                  <div class="tooltip__link">
                    <a href="">Is Love at First Sight Real?</a>
                  </div>
                  <div class="tooltip-read">
                    <a href="">Читать</a> <span></span>
                  </div>
                  <div v-on:click="close" class="tooltip_close"></div>
                </span>
              </span>
              серию экспериментов и пришли к выводу, что <span v-on:click="open" class="link">любви
                <span class="tooltip">
                  <div class="tooltip__link">
                    <a href="">Is Love at First Sight Real?</a>
                  </div>
                  <div class="tooltip-read">
                    <a href="">Читать</a> <span></span>
                  </div>
                  <div v-on:click="close" class="tooltip_close"></div>
                </span>
              </span> с первого взгляда не существует.
              Люди путают её с сексуальным влечением, которое возникает, когда мы видим человека с привлекательной
              внешностью.
            </p>
            <p>
              Учёные вообще любят<span v-on:click="open" class="link"> объяснять
                <span class="tooltip">
                  <div class="tooltip__link">
                    <a href="">Is Love at First Sight Real?</a>
                  </div>
                  <div class="tooltip-read">
                    <a href="">Читать</a> <span></span>
                  </div>
                  <div v-on:click="close" class="tooltip_close"></div>
                </span>
              </span>
              любовь химическими процессами в организме. С точки зрения нейробиологии,
              существует три нейрофизиологические подсистемы, которые запускают половое влечение, влюблённость и
              привязанность.
            </p>
            
          </div>
        </div>
      </div>
      <Squares />
      <div class="slider-circle">
        <div class="slider-circle__background"></div>
        <div class="slider-circle__image">
        </div>
        <div class="slider-circle slider">
          <div class="slider__container">
            <SliderFirstItem title="Половое влечение">
              это и есть «любовь с первого взгляда». Решающую роль в этом процессе играет тестостерон (и у мужчин, и у
              женщин). Этот гормон побуждает искать потенциальных партнёров, но не вызывает зависимости от конкретного
              человека. Если симпатия невзаимна, вы легко переживёте отказ.
            </SliderFirstItem>
            <SliderFirstItem title="Влюблённость">
              это сильная эмоциональная зависимость от конкретного человека. Она формируется под влиянием дофамина.
              Влюблённый человек чувствует эйфорию, прилив сил и «бабочек в животе». Это чувство вдохновляет писать
              стихи и песни, ночевать под окнами, делать сюрпризы и совершать безумные поступки. Но расставание или
              отсутствие взаимности.
            </SliderFirstItem>
            <SliderFirstItem title="Привязанность">
              это доверительных отношений с партнёром. Она формируется благодаря гормонам окситоцину и вазопрессину.
            </SliderFirstItem>
          </div>
        </div>
      </div>
      <SliderFirstItem />
      <div class="container__content">
        <div class="container__inner">
          <div class="container__item1">
            <p>Любовь может начаться с любого из этих чувств. Например, привязанность к другу или коллеге
              <span v-on:click="open" class="link"> способна
                <span class="tooltip">
                  <div class="tooltip__link">
                    <a href="">Is Love at First Sight Real?</a>
                  </div>
                  <div class="tooltip-read">
                    <a href="">Читать</a> <span></span>
                  </div>
                  <div v-on:click="close" class="tooltip_close"></div>
                </span>
              </span>
              перерасти в романтические отношения: не обязательно сначала влюбляться или испытывать физическое
              влечение.</p>
            <p>Не стоит расстраиваться, если с первого взгляда между вами не пробежала искра.
              В среднем человеку <span v-on:click="open" class="link"> нужно
                <span class="tooltip">
                  <div class="tooltip__link">
                    <a href="">Is Love at First Sight Real?</a>
                  </div>
                  <div class="tooltip-read">
                    <a href="">Читать</a> <span></span>
                  </div>
                  <div v-on:click="close" class="tooltip_close"></div>
                </span>
              </span> девять свиданий, чтобы привыкнуть к новому </p>
          </div>
          <div id="item2" class="container__item">
            <ArticleCover number="02" :img="item2">
              <span>
                Где найти
              </span>
              <span>
                Свою любовь
              </span>
            </ArticleCover>
          </div>
        </div>
      </div>
      <StickyScrollBlock title="В инернете" :background="scrollimage1">
        <div class="container-sticky__item2-content-title">
          Приложения и сайты знакомств
        </div>
        <div class="container-sticky__item2-item">
          <p>
            Виртуальные знакомства не требуют больших усилий и доступны самым стеснительным и скромным. Как
            правило, переписка начинается только в случае обоюдной симпатии, поэтому вы не тратите время на
            бессмысленное общение.
          </p>
          <p>
            С другой стороны, онлайн-знакомства заставляют много времени проводить в интернете и <span v-on:click="open"
              class="link"> редко
              <span class="tooltip">
                <div class="tooltip__link">
                  <a href="">Is Love at First Sight Real?</a>
                </div>
                <div class="tooltip-read">
                  <a href="">Читать</a> <span></span>
                </div>
                <div v-on:click="close" class="tooltip_close"></div>
              </span>
            </span>
            заканчиваются крепким союзом. Бывает, что пользователи таких сайтов настроены не на серьёзные
            отношения, а на мимолётную интрижку. А для кого-то это просто способ развлечься и скоротать
            время.
          </p>
          <p>
            Но не стоит отбрасывать онлайн-знакомства как вариант. Вы можете найти людей с похожими
            интересами, хобби и взглядами на жизнь, которых вы не встретили бы в реальной жизни.
          </p>
        </div>
        <div class="container-sticky__item2-content-title">
          Социальные сети
        </div>
        <div class="container-sticky__item2-item">
          <p>
            Хотя «ВКонтакте», Facebook и Instagram не заточены под знакомства, в соцсетях есть удобный поиск,
            тематические сообщества и группы, посвящённые предстоящим тусовкам. По личной странице
            пользователя проще понять, какой перед вами человек: чем увлекается, с кем дружит и куда
            последний раз ездил в отпуск.
          </p>
          <p>
            Сложность знакомства в соцсетях — начать переписку и не испортить первое впечатление. Банальное
            «Привет, как дела?» не подойдёт, но и открыто флиртовать тоже не стоит. Вполне возможно, что
            человек, которому вы пишете, не ищет отношений.
          </p>
          <p>
            Пишите грамотно и обращайтесь на «вы». Если переписка выходит оживлённой, можно отметить это и
            предложить перейти на «ты». Ставьте лайки и пишите комментарии — они ни к чему не обязывают, но
            показывают, что вы были на странице пользователя и просматривали его профиль.
          </p>
          <p>
            Чтобы придумать, что написать, действуйте по обстоятельствам. Например, если нашли человека в
            тематической группе, спросите что-нибудь о хобби. Понравился парень-байкер — спросите у него,
            когда будет открытие мото-сезона и как в нём поучаствовать. Девушка выкладывает фотографии с
            утренних пробежек — поинтересуйтесь, как ей удаётся так рано вставать, потому что вы тоже хотите
            (если хотите, конечно).
          </p>
          <p>
            Тем, кто привык общаться в интернете, традиционные способы знакомства могут казаться странными и
            неуместными. Мы с подозрением относимся к незнакомцам на улице, в метро или супермаркете и ждём
            подвоха — вдруг это мошенник или городской сумасшедший. Опускать руки не стоит: люди по-прежнему
            находят друг друга в реальной жизни.
          </p>
        </div>
      </StickyScrollBlock>
      <StickyScrollBlock title="В реальной жизни" :background="scrollimage2">
        <div class="container-sticky__item2-content-title">
          Среди общих друзей
        </div>
        <div class="container-sticky__item2-item">
          <p>Примерно 30% пар <span v-on:click="open" class="link"> знакомятся
              <span class="tooltip">
                <div class="tooltip__link">
                  <a href="">Is Love at First Sight Real?</a>
                </div>
                <div class="tooltip-read">
                  <a href="">Читать</a> <span></span>
                </div>
                <div v-on:click="close" class="tooltip_close"></div>
              </span>
            </span> через общих друзей. Произойти это может как угодно: на вечеринке, в
            поездке за город на шашлыки. Знакомства через общих друзей нередко заканчиваются крепким союзом,
            потому что у пары примерно одинаковый социальный статус и схожие интересы.</p>
        </div>
        <div class="container-sticky__item2-content-title">
          В кафе, баре или ресторане
        </div>
        <div class="container-sticky__item2-item">
          <p>По статистике, 20% людей находят партнёра в баре или ресторане. Расслабленная обстановка, музыка
            и алкоголь способствуют новым знакомствам. Но знакомство в баре больше <span v-on:click="open" class="link">
              подходит
              <span class="tooltip">
                <div class="tooltip__link">
                  <a href="">Is Love at First Sight Real?</a>
                </div>
                <div class="tooltip-read">
                  <a href="">Читать</a> <span></span>
                </div>
                <div v-on:click="close" class="tooltip_close"></div>
              </span>
            </span> для краткосрочных
            связей, а не для построения отношений на всю жизнь. </p>
        </div>
        <div class="container-sticky__item2-content-title">
          На работе
        </div>
        <div class="container-sticky__item2-item">
          <p>Найти свою любовь можно среди коллег. Чем больше коллектив, тем выше шансы. Но будьте осторожны:
            отношения могут мешать работе, вызывать вопросы у начальства и сплетни среди коллег. </p>
          <p>
            В то же время общая работа сближает: вы вместе завтракаете и едете в офис, вам есть с кем
            обсудить трудности и у кого попросить помощи.</p>
        </div>
        <div class="container-sticky__item2-content-title">
          На тусовках по интересам
        </div>
        <div class="container-sticky__item2-item">
          <p>Будущего партнёра можно найти на тематических встречах: интеллектуальных или спортивных играх,
            концертах, выставках или лекциях. Если вы интроверт, берите с собой друга или подругу и выбирайте
            события, которые вам действительно интересны. На них вы с большей вероятностью встретите человека
            со схожими взглядами и сможете завязать знакомство.</p>
        </div>
        <div class="container-sticky__item2-content-title">
          На бысрых свиданиях
        </div>
        <div class="container-sticky__item2-item">
          <p>Это специально организованные свидания с большим количеством участников. Обычно они устроены
            примерно так: двое людей общаются в течение нескольких минут, затем пары меняются. За короткое
            время нужно произвести впечатление на партнёра. Если симпатия взаимна, вы обмениваетесь
            контактами. </p>
        </div>
        <div class="container-sticky__item2-content-title">
          Там где вы обычно бываете
        </div>
        <div class="container-sticky__item2-item">
          <p>
            Найти партнёра можно где угодно: в супермаркете, метро или спортивном зале. Любовь может стоять
            рядом, ожидая зелёного сигнала светофора или сидеть за соседним столиком в кафе. Проблема в том,
            что начать знакомство очень страшно — вам может казаться, что лучше вовсе не знакомиться, чем
            получить отказ.
          </p>
          <p>
            Универсального совета, как побороть страх, нет, но есть работающая фраза: «Лучше сделать и
            пожалеть, чем не сделать, но всё равно пожалеть». В худшем случае вы получите отказ, в лучшем —
            найдёте партнёра всей своей жизни. В этом явно больше смысла, чем страдать из-за своей
            нерешительности и не знакомиться ни с кем.
          </p>
        </div>
      </StickyScrollBlock>
      <Commentary>
        <p>Нет ничего необычного в чувстве тревоги перед знакомством или первым свиданием. Испытывать волнение перед
          важной встречей нормально. Если же это болезненный парализующий страх, с ним нужно работать: в первую очередь
          — разбираться в причинах.</p>
        <p>Сильный страх знакомства может быть связан с неприятной ситуацией, пережитой в прошлом. Или с социальным
          страхом: когда человек боится, что другие увидят в нём нечто постыдное, это приводит к робости и тревоге в
          общении с другими людьми, причем не только в романтическом контексте. Причиной также может быть чрезмерная
          фиксация на цели завязать отношения.</p>
        <p>Во многих случаях справиться со страхом знакомства помогает практика. Чем чаще вы знакомитесь, тем
          реалистичнее будут ожидания при каждой попытке. Если справиться со страхом самостоятельно не удаётся —
          обратитесь за помощью к психологу.</p>
      </Commentary>
    <Squares />
      <div class="container__content">
        <div class="container__inner">
          <div id="item3" class="conteiner__item">
            <ArticleCover number="03" :img="item3">
              <span>
                Как вести себя
              </span>
              <span>
                На первом
              </span>
              <span>
                Свидании
              </span>
            </ArticleCover>
            <Harmonic title="Будьте собой, но не теряйте лицо">
              <div class="container__crop-content">
                <p>Вы интуитивно будете стараться произвести самое приятное впечатление: на первое свидание люди
                  приносят лучшую версию себя. Но не пытайтесь показаться идеальным человеком.</p>
                <p>Люди
                  испытывают
                  симпатию к чужим слабостям, а совершенство, наоборот, вызывает недоверие. Если
                  нервничаете, не стесняйтесь сказать: «Я немного волнуюсь, в первый раз иду на свидание после
                  знакомства в интернете». Честность располагает, к тому же партнёр поймёт, что ради свидания с ним вы
                  преодолели свои страхи.</p>
                <p>
                  Однако, какой бы оборот ни принимал вечер, не теряйте спокойствия и приветливости. Не закипайте, если
                  в кафе официант перепутает заказ, не кричите на таксиста, повернувшего не туда, не показывайте
                  нетерпение в очереди. Даже если вы частенько так делаете. Малознакомый человек может спроецировать
                  любую негативную эмоцию на себя или подумать, что вы склочник и неврастеник.
                </p>
              </div>
            </Harmonic>
            <Harmonic title="Используйте общий контекст как тему для разговора">
              <div class="container__crop-content">
                <p>Миа Уоллес из «Криминального чтива» говорила, что с правильным человеком можно «наконец-то
                  заткнуться и комфортно разделить тишину». Это работает почти всегда, но только не на первом свидании.</p>
                <p>Молчать в первую встречу неловко, а вымученные темы для разговора видно сразу: мало кому так уж
                  интересно обсуждать погоду. Лучше посмотрите вокруг — ситуация, которая объединяет вас в данный
                  момент, всегда даст темы для разговора.</p>
                <p>В кафе обсудите меню, любимую еду и напитки, блюда разных кухонь мира, которые вы пробовали. В музее
                  — искусство, художников, последние выставки. Совместный контекст даёт даже метро: можно вместе
                  поругать наземные пробки или поговорить о дороге на работу.
                </p>
              </div>
            </Harmonic>
            <Harmonic title="Если нервничаете, садитесь рядом, а не напротив">
              <div class="container__crop-content">
                <p>Когда вы сидите напротив, вам некуда смотреть, кроме как на собеседника, и это может создать
                  несколько неловких моментов. Как долго можно смотреть в глаза? Вдруг я слишком пялюсь? Куда можно
                  смотреть, а куда нельзя? Любая заминка в разговоре очень заметна, когда вы сидите лицом к лицу.</p>
                <p>Другое дело — когда вы сидите рядом. Вы оба можете без неловкости менять фокус внимания, вместе
                  смотреть вперёд и по сторонам во время паузы, самостоятельно дозировать зрительный контакт.</p>
              </div>
            </Harmonic>
            <Harmonic title="Найдите тактильный баланс">
              <div class="container__crop-content">
                <p>Коучи Бенджамин Эванс и Томас Эдвордс
                  говорят, что провести весь вечер без каких бы то ни было прикосновений — это дорога во френдзону.
                  Тактильный контакт особенно важен, если человек вам очень понравился и уже сегодня вы рассчитываете
                  на поцелуй. Перейти к поцелую, ни разу не коснувшись друг друга, — это всё равно что пытаться
                  разогнаться от 0 до 100 км/ч за секунду.</p>
                <p>Первое прикосновение может произойти уже во время приветствия. Если не хотите сразу заключать
                  человека в объятия, можно просто коснуться плеча, предлагая идти, или пожать руку.</p>
                <p>
                  Во время свидания найдите способ коснуться партнёра, и его реакция поможет понять, насколько ваша
                  симпатия взаимна. Например, молодой человек может подать руку, когда девушка сходит со ступеней, а
                  девушка — дружески похлопать мужчину по руке в подходящий момент. Не стоит сразу брать за руку — этот
                  жест слишком интимный.
                </p>
                <p>
                  Первые прикосновения должны быть нейтральными и уместными. Если любые касания вызывают вежливое
                  отстранение, отступите.
                </p>
              </div>
            </Harmonic>
            <Harmonic title="Слушайте и не спешите говорить">
              <div class="container__crop-content">
                <p>Большинство людей во время рассказа другого человека
                  обдумывают свой ответ. Сломайте систему: слушайте, что говорит человек, и не спешите вставлять «а вот
                  я», «а вот у меня». Уточняйте, узнавайте детали, спросите, что дала человеку эта ситуация, и только
                  потом переходите к своему опыту.</p>
                <p>Глубинная
                  потребность всех людей — чувствовать, что их слова важны и что они сами имеют значение. Проявив
                  неподдельный интерес, вы сможете расположить человека к себе и дать ему раскрыться. Партнёр захочет
                  снова и снова оказываться в вашей компании, где так комфортно делиться чувствами.</p>
              </div>
            </Harmonic>
            <Harmonic title="Продумайте завершение вечера">
              <div class="container__crop-content">
                <p>Даже если свидание прошло идеально, в конце вас ждут ещё несколько неловких моментов: оплата счёта,
                  прощание и разговор о следующей встрече.</p>
                <p>На первом свидании игра часто идёт по старым правилам: инициатива оплаты счёта
                  ожидается от мужчины. Нейтральный вариант, подходящий любым парам, — поделить счёт пополам. Или пусть
                  расходы возьмёт на себя тот, кто приглашал на встречу и выбирал место.</p>
                <p>
                  Если хотите встретиться с человеком ещё раз, сообщите об этом максимально ненавязчиво. Не настаивайте
                  на моментальном ответе, если партнёр пока не может его дать. Личное пространство другого человека —
                  это тонкая материя, и обращаться с ней нужно аккуратно.
                </p>
                <p>
                  Если понимаете, что ваше первое свидание станет последним, поблагодарите человека за его время и
                  компанию и попрощайтесь. Не пропадайте просто так: напишите, что хорошо провели время и рады
                  знакомству, но ничего большего из этого не выйдет.
                </p>
                <p>
                  Некоторые удачные свидания завершаются совместным завтраком, другие — дружеским объятием у метро.
                  Секс на первом свидании двух взрослых людей по взаимному согласию в 2019 году не считается чем-то
                  аморальным. Как, впрочем, и его отсутствие не говорит о том, что вы ханжа. У каждого из нас свои
                  представления о близости, главное — уважать границы партнёра и не терять голову.
                </p>
              </div>
            </Harmonic>
          </div>
          <div id="item4" class="conteiner__item">
            <ArticleCover number="04" :img="item4">
              <span>
                Как понять что
              </span>
              <span>
                Вы нашли своего
              </span>
              <span>
                Человека
              </span>
            </ArticleCover>
            <p>
              Влюблённость не то же самое, что любовь. Можно здорово проводить время вместе и строить планы на будущее,
              а потом понять, что это не ваш человек, и расстаться. По статистике, 56% людей
              <span v-on:click="open" class="link"> расстаются
                <span class="tooltip">
                  <div class="tooltip__link">
                    <a href="">Is Love at First Sight Real?</a>
                  </div>
                  <div class="tooltip-read">
                    <a href="">Читать</a> <span></span>
                  </div>
                  <div v-on:click="close" class="tooltip_close"></div>
                </span>
              </span> после первого секса, 26% — из-за потери интереса к партнёру, ещё 18% встречают кого-то
              другого.
            </p>
            <p>
              И всё же перед началом совместной жизни хочется быть уверенным, что вы встретили своего человека.
              Психологи из Эксетерского университета
              <span v-on:click="open" class="link"> провели
                <span class="tooltip">
                  <div class="tooltip__link">
                    <a href="">Is Love at First Sight Real?</a>
                  </div>
                  <div class="tooltip-read">
                    <a href="">Читать</a> <span></span>
                  </div>
                  <div v-on:click="close" class="tooltip_close"></div>
                </span>
              </span> исследование и составили список из 10 пунктов, которые помогут взглянуть на отношения со стороны
              и понять, действительно ли вы встретили своего человека.
            </p>
            <div class="content__item4 slider">
              <SliderFourItem title="Вы подходите друг другу по образу жизни">
                Речь о совместимости: вы живёте примерно в одном ритме, у вас похожие ценности и взгляды на быт. Или,
                как минимум, не противоположные. Людям трудно ужиться, если один предпочитает шумные вечеринки, а
                другой — тихие домашние вечера. Спросите себя, готовы ли вы терпеть человека со всеми его недостатками
                или вам сложно скрывать раздражение.
              </SliderFourItem>
              <SliderFourItem title="Вы хорошие друзья">
                в отношениях, если их связывает крепкая дружба. Интимная жизнь имеет значение, но вам должно быть
                хорошо не только в постели. Просмотр сериала, поход в супермаркет или выбор нового дивана в гостиную —
                любое действие приятнее совершать вместе, чем одному.
              </SliderFourItem>
              <SliderFourItem title="Вы хотите одного и того же">
                Кто-то мечтает о большой семье, другой — о карьере в международной компании. Один считает, что
                обязанности по дому нужно делить, а другой с этим не согласен. На начальном этапе обсуждать такие
                вопросы не принято, но зачем тянуть? Планы на жизнь могут не совпадать, поэтому стоит поговорить о них
                заранее.
              </SliderFourItem>
              <SliderFourItem title="Ваши ожидания и планы реалистичны ">
                <p>Чем сильнее завышены ожидания, тем больнее воспринимать реальность. К отношениям это тоже относится.</p>
                <p>Например, девушка ждёт от парня дорогих подарков: норковую шубу, кольцо с бриллиантом и букеты роз
                  по пятницам. А получает воздушные шарики и полевые цветы. Она расстроена, потому что ждала большего.</p>
                <p>Чем больше разочарования накапливается в паре, тем менее счастливыми становятся отношения.</p>
              </SliderFourItem>
              <SliderFourItem title="Вы видите друг в друге лучшие качества">
                Попытки переделать партнёра вряд ли приведут к хорошему результату. Если в начале отношений вы
                замечаете недостатки и чувствуете, что раздражаетесь из-за бытовых мелочей, стоит задуматься, что будет
                дальше. У проблемы есть два решения. Первое — вместо того чтобы замечать недостатки, обращать внимания
                на достоинства. Второе — поговорить о том, что вас раздражает, с партнёром.
              </SliderFourItem>
              <SliderFourItem title="Вы оба работаете над отношениями">
                В крепких отношениях оба партнёра идут на компромиссы и прислушиваются к мнению любимого человека. Это
                не значит, что счастливые пары не ссорятся. Конфликты будут в любом случае, а вот решать их можно
                по-разному. В идеале нужно прийти к решению, которое устраивает обоих. Признак нездоровых отношений —
                стоять на своём до последнего, не пытаясь прислушаться к партнёру.
              </SliderFourItem>
              <SliderFourItem title="Вы честны друг с другом">
                Быть честным в отношениях непросто, но если скрывать недовольство, то раздражение будет только расти.
                Пустяковая ссора может привести к скандалу, и вот тут вы припомните все свои обиды: вечно
                незаправленную кровать, грязную посуду и крошки на столе.
              </SliderFourItem>
              <SliderFourItem title="Вы готовы вместе пройти через трудности">
                Любовь — это переживать все трудности вместе. Вместе делать ремонт, вместе платить ипотеку, по очереди
                менять подгузники и убаюкивать ребёнка. А если во время трудностей партнёр уходит, хлопая дверью, то,
                возможно, вы пока не встретили своего человека.
              </SliderFourItem>
              <SliderFourItem title="Вы поддерживаете друг друга в сложной ситуации">
                Боль близкого человека переживается как своя. Вспомните, как партнёр ведёт себя, когда у вас тяжёлый
                день. В трудной ситуации можно обнять, подбодрить и разогреть любимому человеку ужин. Другое дело,
                когда вместо слов поддержки вы слышите критику и недовольство в свой адрес.
              </SliderFourItem>
              <SliderFourItem title="У вас есть поддержка со стороны ">
                Иногда, чтобы снять напряжение, нужно просто поплакать у мамы на плече или посидеть с друзьями в баре.
                Поддержка со стороны позволяет разрядить ситуацию, когда оба партнёра устали и близки к эмоциональному
                выгоранию.
              </SliderFourItem>
              <span class="pagingInfo"></span>
            </div>
            <p>Эти признаки помогут понять, что вы нашли своего человека. Не обязательно иметь общие интересы или всё
              время проводить вместе. Гораздо важнее согласие по принципиальным вопросам, умение договариваться и идти
              на компромиссы.</p>
          </div>
          <div id="item5" class="conteiner__item">
            <ArticleCover number="05" :img="item5">
              <span>
                Что делать, если не
              </span>
              <span>
                получается найти
              </span>
              <span>
                любовь
              </span>
            </ArticleCover>
            <p>Эти советы могут вам не понравиться, потому что согласно им нужно начать с себя. Но это поможет понять,
              чего вы хотите от любви и как найти своего человека.</p>
          </div>
        </div>
      </div>
      <StickyScrollBlock :background="scrollimage3">
        <div class="container-sticky__item2-content-title">
          Оцените плюсы вашего положения
        </div>
        <div class="container-sticky__item2-item">
          <p>Во время поиска второй половинки многие настолько погружаются в грусть и страдания, что забывают
            наслаждаться жизнью. Не стоит идеализировать отношения — это не только любовь и романтика, но и уступки,
            компромиссы, частичный отказ от собственных желаний.</p>
          <p>В данный момент жизни вам не нужно решать такие проблемы, поэтому наслаждайтесь свободой и делайте то, что
            вам нравится.</p>
          <p>Психологи регулярно
            <span v-on:click="open" class="link"> находят
              <span class="tooltip">
                <div class="tooltip__link">
                  <a href="">Is Love at First Sight Real?</a>
                </div>
                <div class="tooltip-read">
                  <a href="">Читать</a> <span></span>
                </div>
                <div v-on:click="close" class="tooltip_close"></div>
              </span>
            </span> подтверждения тому, что люди без серьёзных отношений отнюдь не живут меньше и несчастнее, чем
            влюблённые парочки. Наоборот, исследования говорят, что такие люди находят больше друзей, продуктивнее
            проводят свободное время и уделяют больше внимания спорту.</p>
        </div>
        <div class="container-sticky__item2-content-title">
          Ищите счастье в себе
        </div>
        <div class="container-sticky__item2-item">
          <p>Если вы несчастны и думаете, что другой человек наполнит вашу жизнь смыслом, это прямая дорога к
            страданиям в будущих отношениях. Мало кому под силу нести бремя ответственности за чужое счастье.</p>
          <p>Научитесь находить гармонию в себе: развивайтесь, ищите себя, пробуйте новые направления, ставьте цели и
            достигайте их. Когда вы довольны собой, вы начинаете сиять. Перед этим очень сложно устоять — люди
            инстинктивно
            <span v-on:click="open" class="link"> тянутся
              <span class="tooltip">
                <div class="tooltip__link">
                  <a href="">Is Love at First Sight Real?</a>
                </div>
                <div class="tooltip-read">
                  <a href="">Читать</a> <span></span>
                </div>
                <div v-on:click="close" class="tooltip_close"></div>
              </span>
            </span> к тем, кто счастлив и независим.</p>
          <p>Наверняка вы и сами предпочли бы быть именно с таким человеком.</p>
        </div>
        <div class="container-sticky__item2-content-title">
          Подумайте, почему вы ещё не встретили любовь
        </div>
        <div class="container-sticky__item2-item">
          <p>Некоторые люди просто не знают, чего хотят, поэтому бесцельно бросаются из романа в роман. Другие —
            создают в голове эталон идеального партнёра и не смотрят на простых смертных. Третьи страдают заниженной
            самооценкой и считают себя недостойными людей, с которыми хотят быть. </p>
          <p>
            Будьте честны с собой или поговорите с близкими друзьями — иногда особенности поведения виднее со стороны.
            Когда вы поймёте, что было преградой всё это время, сможете разрешить проблему: например, больше
            знакомиться или вспомнить, что никто не идеален, и смягчить свой перфекционизм.</p>
        </div>
        <div class="container-sticky__item2-content-title">
          Следите за внешним видом
        </div>
        <div class="container-sticky__item2-item">
          <p>Несмотря на то, что вы сейчас одиноки, не скатывайтесь в неряшливость, думая, что на вас всё равно никто
            не смотрит.</p>
          <p>Безусловно, любовь не возникает благодаря одной лишь внешности. Но чтобы дойти до глубоких чувств, нужно
            сначала заинтересовать человека. Очень часто именно внешняя привлекательность даёт самый первый импульс
            интереса.</p>
          <p>Занимайтесь спортом, экспериментируйте со стилем одежды и аксессуаров, решитесь на новую стрижку. Делайте
            это в первую очередь для себя: чтобы выходить из дома с мыслью «я круто выгляжу». Это придаст вам
            уверенности, а психологи
            <span v-on:click="open" class="link"> утверждают
              <span class="tooltip">
                <div class="tooltip__link">
                  <a href="">Is Love at First Sight Real?</a>
                </div>
                <div class="tooltip-read">
                  <a href="">Читать</a> <span></span>
                </div>
                <div v-on:click="close" class="tooltip_close"></div>
              </span>
            </span>, что именно это качество притягивает других людей.</p>
        </div>
        <div class="container-sticky__item2-content-title">
          Разберитесь, чего вы хотите от партнёра
        </div>
        <div class="container-sticky__item2-item">
          <p>Чтобы что-то найти, нужно знать, что вы ищете. Речь идёт не об идеальных внешних параметрах: такие
            критерии вообще лучше не задавать. Важнее понимание того, какого человека вы видите рядом с собой. </p>
          <p>Попробуйте это <span v-on:click="open" class="link"> упражнение
              <span class="tooltip">
                <div class="tooltip__link">
                  <a href="">Is Love at First Sight Real?</a>
                </div>
                <div class="tooltip-read">
                  <a href="">Читать</a> <span></span>
                </div>
                <div v-on:click="close" class="tooltip_close"></div>
              </span>
            </span>: запишите три качества, без которых другой человек вам точно будет не мил.
            Например, ваш будущий партнёр должен быть добрым, хотеть завести детей и любить спорт. А затем напишите три
            качества, на которые вы не согласитесь ни при каких обстоятельствах: допустим, самовлюблённость,
            паникёрство и неприязнь к животным.</p>
          <p>Даже эта простая структура поможет оценить, кто перед вами: кандидат на счастливые отношения или человек,
            чьи ценности далеки от ваших.</p>
        </div>
      </StickyScrollBlock>
      <Commentary>
        <p>Найдёте ли вы партнёра, зависит от множества факторов, многие из которых не в вашей власти. Поэтому не стоит
          относиться к поиску как к задаче чрезмерной важности: в этом случае в фокусе внимания оказываются не сами
          отношения, а формальный результат.</p>
        <p>Люди, которые приходят на терапию с сильным желанием найти партнёра, испытывают дискомфорт и фрустрацию,
          сталкиваясь с неудачей. А отпустив желание непременно реализоваться в сфере отношений, неожиданно легко
          находят спутника жизни.</p>
        <p>Ощущение готовности вступить в отношения может быть очень приятным. Но это не значит, что вы должны каждую
          минуту делать всё возможное и невозможное, чтобы найти их. Представьте себе, что отношения — это голубь,
          которого вы пытаетесь поймать. Если вы преследуете голубя, вы можете его напугать и он улетит. Но если
          просто протянуть руку и подождать, то, возможно, голубь сядет на неё сам.</p>
      </Commentary>
    </div>
  </div>
</template>

<script>
  import SideBar from './components/SideBar.vue'
  import SliderFourItem from './components/SliderFourItem.vue'
  import StickyScrollBlock from './components/StickyScrollBlock.vue'
  import Harmonic from './components/Harmonic.vue'
  import Commentary from './components/Commentary.vue'
  import SliderFirstItem from './components/SliderFirstItem.vue'
  import Squares from './components/Squares.vue'
  import Form from './components/Form.vue'
  import Header from './components/Header.vue'
  import ArticleCover from './components/ArticleCover.vue'
  import image1 from '@/assets/01.png'
  import image2 from '@/assets/02.png'
  import image3 from '@/assets/03.png'
  import image4 from '@/assets/04.png'
  import image5 from '@/assets/05.png'
  import scrollimage1 from '@/assets/scroll-image1.png'
  import scrollimage2 from '@/assets/scroll-image2.png'
  import scrollimage3 from '@/assets/scroll-image3.png'

  export default {
    el: '#app',
    data() {
      return {
        item1: {
          background: 'url(./' + image1 + ')'
        },
        item2: {
          background: 'url(./' + image2 + ')'
        },
        item3: {
          background: 'url(./' + image3 + ')'
        },
        item4: {
          background: 'url(./' + image4 + ')'
        },
        item5: {
          background: 'url(./' + image5 + ')'
        },
        scrollimage1: {
          background: 'url(./' + scrollimage1 + ')'
        },
         scrollimage2: {
          background: 'url(./' + scrollimage2 + ')'
        },
          scrollimage3: {
          background: 'url(./' + scrollimage3 + ')'
        }    
      }
    },
    methods: {
      open: function (event) {
        event.target.childNodes[1].style.visibility = 'visible';

      },
      close: function (event) {
        event.target.parentNode.style.visibility = 'hidden';
      },
    },
    mounted() {
      let tooltip = document.querySelectorAll('.tooltip');

      for (var i = 0; i < tooltip.length; i++) {
        let tooltipParametr = tooltip[i].getBoundingClientRect();
        tooltip[i].style.top = -tooltipParametr.height - 20 + 'px';
      }
    },
    components: {
      SideBar,
      Header,
      ArticleCover,
      Form,
      Squares,
      SliderFirstItem,
      Commentary,
      Harmonic,
      StickyScrollBlock,
      SliderFourItem
    }
  }
</script>
<style lang="scss">
  @font-face {
    font-family: "Montserrat-Regular";
    font-style: normal;
    font-weight: 300;
    src: url("fonts/Regular.ttf") format("woff2");
  }
  @font-face {
    font-family: "Montserrat-Bold";
    font-style: normal;
    font-weight: 700;
    src: url("fonts/Regular.ttf") format("woff2");
  }

  @font-face {
    font-family: "Pattaya";
    font-style: normal;
    font-weight: 300;
    src: url("fonts/pattaya.ttf") format("woff2");
  }

  body {
    margin: 0;
    padding: 0;
    overflow-x: hidden;
  }

  button, input textarea {
    outline: none;
  }

  .container {
    &__cover {
      background-image: url('assets/back.png');
      background-size: cover;
      background-position-y: -100px;
      height: 490px;
      background-repeat: no-repeat;
    }

  &__item {
    position: relative;
  }

    &__share {
      display: none;

      &__link {
        height: 64px;
        width: 64px;

        a {
          width: 100%;
          display: block;
          background: #4dd0df;
          height: 100%;
          transition: .2s;
          align-items: center;
          justify-content: center;
          display: flex;

          &:hover {
            background: #00bbd2;
            transition: .2s;
          }
        }
      }
    }

    &__logo {
      position: absolute;
      right: 33px;
      top: 18px;

      img {
        width: 130px;
        max-width: 100%;
        margin: 0px 10px;
      }
    }

    &__content {
      max-width: 940px;
      min-width: 320px;
      margin: 0 auto;
      text-align: center;

      p {
        font-family: "Montserrat-Regular";
        font-style: normal;
        font-size: 14px;
        text-align: left;
        line-height: 1.88;
        letter-spacing: -.3px;

      }
    }

    h1 {
      font-weight: 300;
      position: relative;
      background: #fff;
      font-family: Pattaya;
      font-size: 54px;
      padding-bottom: 17px;
      width: auto;
      padding-top: 50px;
      letter-spacing: 1.7px;

      &::before {
        content: "";
        background: #00bbd2;
        position: absolute;
        left: 0;
        z-index: 2;
        right: -68px;
        margin: 0 auto;
        bottom: 12px;
        width: 115px;
        height: 7px;

      }
    }

    &__header {
      background: white;
      margin-top: -16%;
      padding: 0 180px;

      p {
        font-family: "Montserrat-Regular";
        font-style: normal;
        font-size: 14px;
        text-align: left;
        line-height: 1.88;
        letter-spacing: -.3px;
      }

      &-right {
        padding-left: 41px;
      }
    }

    &__inner {
      padding: 0 126px;
    }

    .article-cover__title {
      position: absolute;
      right: -88px;
      bottom: 39px;
      text-transform: uppercase;
      font-size: 30px;
      line-height: normal;
      font-weight: 300;
      font-family: "Montserrat";
      color: white;
      text-align: left;
      display: inline-block;
      float: left;
      width: 400px;

      span {
        background: #00bbd2;
        margin-bottom: 6px;
        padding: 10px 12px;
        float: left;
      }
    }
  }

  .link {
    color: red;
    position: relative;
    display: inline-block;
    cursor: pointer;

    .tooltip {
      position: absolute;
      visibility: hidden;
      transition: .3s;
      background: black;
      width: 250px;
      padding: 35px;
      left: 0;

      a {
        color: white;
        text-decoration: none;
      }

      &__link {
        border-bottom: 6px solid #00bbd2;
        border-top: 6px solid #00bbd2;
        padding: 5px;
        font-size: 18px;
        font-weight: 700;
      }

      .tooltip-read {
        margin-top: 29px;
        position: relative;

        a {
          text-transform: lowercase;
          font-size: 16px;
          width: 100%;
          display: block;
        }

        &:after {
          content: "";
          position: absolute;
          width: 134px;
          height: 2px;
          background: white;
          right: -107px;
          left: 0;
          margin: 0 auto;
          top: 15px;
          opacity: 0.7;
        }
      }

      span {

        &:after,
        &:before {
          content: "";
          position: absolute;
          width: 16px;
          height: 2px;
          background: white;
          right: 4px;
          margin: 0 auto;
          top: 11px;
          opacity: 0.7;
        }

        &:after {
          transform: rotate(29deg);
        }

        &:before {
          transform: rotate(-29deg);
          top: 19px;
        }
      }

      .tooltip_close {

        &:before,
        &:after {
          display: block;
          width: 20px;
          height: 1px;
          background: #fff;
          position: absolute;
          top: 13px;
          right: 5px;
          content: "";
          transition: all .5s cubic-bezier(.19, 1, .22, 1);
        }

        &:before {
          transform: rotate(45deg);
        }

        &:after {
          transform: rotate(-45deg);
        }
      }

      &:after {
        content: "";
        position: absolute;
        bottom: -24px;
        border: 19px solid transparent;
        border-left: 33px solid black;
        border-top: 15px solid black;
      }
    }

    .tooltip_close {
      width: 29px;
      height: 27px;
      position: absolute;
      right: 0;
      top: 0;
      cursor: pointer;
    }
  }

  @media (max-width: 768px) {

html {
  overflow-x: hidden;
}

    .container {
      &__inner {
        padding: 0 40px
      }

      &__logo {
        display: none;
      }

      &__share {
        position: absolute;
        bottom: 0;
        z-index: 10;
        top: 0;
        width: 200px;
        right: 0;
        display: flex;
        left: 0;
        margin: 0 auto;
      }

      &__cover {
        background-size: cover !important;
        position: relative;
        top: 0;
        padding-bottom: 69%;
        height: auto;
        background-position: center center !important;
      }

      &__header {
        margin-top: -33%;
        position: relative;
      }

      h1 {
        padding-top: 83px;
      }
    }

    .header {
      display: none;
    }
       .container h1 {
      font-size: 39px;
    }
  }
   @media (max-width: 480px) {
      .container {
        &__header{
              padding: 0 11px !important;
        }
        &__cover{
        background-position-y: 37px !important;
      }
      }
   }
</style>
